I have tested on FOS v6.0.0, v6.2.0, v6.2.4, the problem could not be reproduced, the steps are as follows. It looks a bit strange. Can you please provide your FortiGate firemware version  (GUI: Dashboard->Status->System Information->Fireware or CLI: get system status->Version) and try the following configuration in your test environment? Thanks!

root@sv:/FOSENV# cat main.tf
```
provider "fortios" {
  hostname = "192.168.52.177"
  token    = "XXXXXXXXXXXXXXXXXXXXXXXXX"
  insecure = "true"
}

resource "fortios_firewall_security_policy" "policy6" {
  name = "Windows Updates"
  srcintf = ["port2"]
  dstintf = ["port1"]
  srcaddr = ["all"]
  dstaddr = []
  internet_service = "enable"
  internet_service_id = ["196608"]     <=============================(1)
  action = "accept"
  schedule = "always"
  service = []
  logtraffic = "all"
  nat = "enable"
  ippool = "disable"
  poolname = []
  profile_protocol_options = "default"
  utm_status = "enable"
  av_profile = "default"
  comments = "Created in Terraform"
  status = "enable"

  lifecycle {
    create_before_destroy = true
  }
}

```
root@sv:/FOSENV# terraform init

```
.....
```
root@sv:/FOSENV# terraform apply
```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_security_policy.policy6 will be created
  + resource "fortios_firewall_security_policy" "policy6" {
      + action                   = "accept"
      + application_list         = (known after apply)
      + av_profile               = "default"
      + capture_packet           = (known after apply)
      + comments                 = "Created in Terraform"
      + dnsfilter_profile        = (known after apply)
      + dstaddr                  = []
      + dstintf                  = [
          + "port1",
        ]
      + id                       = (known after apply)
      + internet_service         = "enable"
      + internet_service_id      = [
          + 196608,
        ]
      + internet_service_src     = (known after apply)
      + ippool                   = "disable"
      + ips_sensor               = (known after apply)
      + logtraffic               = "all"
      + logtraffic_start         = (known after apply)
      + name                     = "Windows Updates"
      + nat                      = "enable"
      + poolname                 = []
      + profile_protocol_options = "default"
      + schedule                 = "always"
      + service                  = []
      + srcaddr                  = [
          + "all",
        ]
      + srcintf                  = [
          + "port2",
        ]
      + ssl_ssh_profile          = (known after apply)
      + status                   = "enable"
      + utm_status               = "enable"
      + webfilter_profile        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_security_policy.policy6: Creating...
fortios_firewall_security_policy.policy6: Creation complete after 0s [id=1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
root@sv:/FOSENV# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_security_policy.policy6: Refreshing state... [id=1]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```
root@sv:/FOSENV# terraform show
```
# fortios_firewall_security_policy.policy6:
resource "fortios_firewall_security_policy" "policy6" {
    action                   = "accept"
    av_profile               = "default"
    capture_packet           = "disable"
    comments                 = "Created in Terraform"
    dstaddr                  = []
    dstintf                  = [
        "port1",
    ]
    id                       = "1"
    internet_service         = "enable"
    internet_service_id      = [
        196608,                                  <=============================(2)
    ]
    internet_service_src     = "disable"
    ippool                   = "disable"
    logtraffic               = "all"
    logtraffic_start         = "disable"
    name                     = "Windows Updates"
    nat                      = "enable"
    poolname                 = []
    profile_protocol_options = "default"
    schedule                 = "always"
    service                  = []
    srcaddr                  = [
        "all",
    ]
    srcintf                  = [
        "port2",
    ]
    ssl_ssh_profile          = "certificate-inspection"
    status                   = "enable"
    utm_status               = "enable"
}
```

FGT Device:
```
# show
config firewall policy
    edit 1
        set name "Windows Updates"
        set uuid c1a4a668-c5c4-51ea-ea94-0434b54ab2b3
        set srcintf "port2"
        set dstintf "port1"
        set srcaddr "all"
        set internet-service enable
        set internet-service-id 196608       <=============================(3)
        set action accept
        set schedule "always"
        set utm-status enable
        set logtraffic all
        set comments "Created in Terraform"
        set av-profile "default"
        set profile-protocol-options "default"
        set ssl-ssh-profile "certificate-inspection"
        set nat enable
    next
end
```



